---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCCWLoop
source: html/91ae4538-e1f5-7183-9490-63721418d287.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCCWLoop Property

This sketch defines more than one footprint. Make sure the sketch contains only one outermost loop and that there are no loops inside inner loops.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotOneCCWLoop { get; }
```